:PROPERTIES:
:ID:       332543dd-dead-4b12-911e-57f61a570ba6
:ROAM_ALIASES: "Kernighan Algorithm"
:END:
#+title: Population Count
#+filetags: :bit-algo:algorithm:programming:

* Problem
Count the number of bits set to $1$ in a given number.
* Naive
Start from the rightmost, test if is set and count in that case, then shift all the bits by $1$ to the right (division by 2).
** Algo
The code here assume an int of 32 bits.
#+begin_src go
package main

import "fmt"

func count(n int) int {
	count := 0
	for i := 0; i < 32; i++ {
		count += n & 1
		n = n >> 1
	}
	return count
}

func main() {
	nums := [...]int{2, 4, 8, 42, 124}
	for _, n := range nums {
		fmt.Printf("PopCount of [%d] := %d\n", n, count(n))
	}
}
#+end_src

#+RESULTS:
: PopCount of [2] := 1
: PopCount of [4] := 1
: PopCount of [8] := 1
: PopCount of [42] := 3
: PopCount of [124] := 5
** Complexity
+ Space $O(1)$
+ Time $O(n)$, where $n$ is the /word size/
* Brian Kernighan's algorithm
The base idea is to not check every bit, it works like the following:
| Steps | Code            |                              |
|-------+-----------------+------------------------------|
|     1 | while n != 0    | There are still bit to count |
|     2 | n = n & (n - 1) | Clean a setted bit [fn:1]    |
|     3 | count++         | Count the removed bit        |
** Algo
#+begin_src go
package main

import "fmt"

func count(n int) int {
	count := 0
	for n != 0 {
		n = n & (n - 1)
		count++
	}
	return count
}

func main() {
	nums := [...]int{2, 4, 8, 42, 124}
	for _, n := range nums {
		fmt.Printf("PopCount of [%d] := %d\n", n, count(n))
	}
}
#+end_src

#+RESULTS:
: PopCount of [2] := 1
: PopCount of [4] := 1
: PopCount of [8] := 1
: PopCount of [42] := 3
: PopCount of [124] := 5
** Complexity
+ Space $O(1)$
+ Time $O(\log{s})$, where $s$ are the number of bits setted.
  + Proof: at each loop we remove one setted bit $\qed$
* Footnotes
[fn:1] $n & (n-1)$ clean the rightmost bit
